{
    "architectures": [
        "GPTNeoForCausalLM"
    ],
    "attention_dropout": 0.0,
    "attention_layers": [
        [
            "local",
            "global"
        ]
    ],
    "attention_types": [
        "global",
        "local"
    ],
    "bos_token_id": 50256,
    "classifier_dropout": 0.0,
    "eos_token_id": 50256,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout": 0.0,
    "hidden_size": 2560,
    "initializer_range": 0.02,
    "intermediate_size": 10240,
    "layer_norm_epsilon": 1e-05,
    "max_position_embeddings": 2048,
    "model_type": "gpt_neo",
    "num_heads": 20,
    "num_layers": 28,
    "pad_token_id": 50256,
    "resid_dropout": 0.0,
    "sep_token_id": 50256,
    "transformer_dropout": 0.0,
    "use_cache": true,
    "vocab_size": 50257
}